<template>
  <div class="about">
    <h1>About</h1>
    <h2>概要</h2>
    <p>たこの餌やりやトイレ掃除等を管理するアプリです。</p>
    <h2>使い方</h2>
    <h3>ログイン</h3>
    <p>
      まずログインしてください。ログインしないとRecordsページにアクセスはできません。
      ユーザー登録はできないので管理者に問い合わせてください。
    </p>
    <h3>レコード管理</h3>
    <p>
      Recordsページでは、今までのお世話記録のレコードをリスト表示できます。
      表示する期間の選択が画面上部の設定で可能です。
      上限と下限を設定して取得ボタンを押してください。
    </p>
    <p>
      レコードを追加するときはタイプとコメントを入力して追加を押すだけです。
      タイプは必須、コメントは任意です。追加を押すとすぐにデータベースに追加されます。
    </p>
    <p>
      ユーザーと時刻は自分で設定はできず、自動で反映されます。
      xボタンは削除ボタンですが、自分が追加したレコードしか削除できません。
    </p>
  </div>
</template>

<style lang="scss" scoped>
.about {
  width: 80%;
  margin: auto;

  > h2 {
    border: 4px dotted #777;
  }
}
</style>
