<template>
  <div class="about">
    <h1>About</h1>
    <h2>概要</h2>
    <p>たこの餌やりやトイレ掃除等を管理するアプリです。</p>
    <h2>使い方</h2>
    <h3>ログイン</h3>
    <p>
      まずログインしてください。ログインしないとRecordsページにアクセスはできません。
      ユーザー登録はできないので管理者に問い合わせてください。
    </p>
    <h3>レコード管理</h3>
    <p>
      Recordsページでは、今までのお世話記録のレコードをリスト表示できます。
      表示する期間の選択が画面上部の設定で可能です。
      上限と下限を設定して取得ボタンを押してください。
    </p>
    <p>
      レコードを追加するときはタイプとコメントを入力して追加を押すだけです。
      タイプは必須、コメントは任意です。追加を押すとすぐにデータベースに追加されます。
    </p>
    <p>
      <s>ユーザーと時刻は自分で設定はできず、自動で反映されます。</s>
      時刻は任意の入力が可能になりました。入力ボックスを開いたまま追加しなければ反映されないので注意してください。
      ユーザーは依然自動反映のみです。
    </p>
    <p>
      レコードについているxボタンは削除ボタンです。削除したレコードは復元できないので注意してください。
      また、自分が追加したレコードしか削除できません（他人のレコードのボタンは薄くなり押すことができません）。
    </p>
  </div>
</template>

<style lang="scss" scoped>
.about {
  width: 80%;
  margin: auto;

  > h2 {
    border: 4px dotted #777;
  }
}
</style>
